Revit 2026 API

# ElementTransformUtilsRotateElement Method

---

Rotates an element about the given axis and angle.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static void RotateElement(
	Document document,
	ElementId elementToRotate,
	Line axis,
	double angle
)
```
```vb
Public Shared Sub RotateElement (
	document As Document,
	elementToRotate As ElementId,
	axis As Line,
	angle As Double
)
```
```cpp
public:
static void RotateElement(
	Document^ document,
	ElementId^ elementToRotate,
	Line^ axis,
	double angle
)
```
```fsharp
static member RotateElement :
        document : Document *
        elementToRotate : ElementId *
        axis : Line *
        angle : float -> unit
```

#### Parameters

document Document
     The document that owns the elements.
elementToRotate ElementId
     The element to rotate.
axis Line
     The axis of rotation.
angle Double
     The angle of rotation in radians.

| Exception | Condition |
| --- | --- |
| ArgumentException | The element elementToRotate does not exist in the document |
| ArgumentNullException | A non-optional argument was null |

#### Reference

ElementTransformUtils Class

Autodesk.Revit.DB Namespace